<img src="http://akhavanpour.ir/notebook/images/srttu.gif" alt="SRTTU" style="width: 150px;"/>

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('salaries.csv')

In [5]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [6]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

In [7]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [8]:
df[['Name','Age']]

     Name  Age
0    John   34
1   Sally   45
2  Alyssa   27

In [9]:
df['Age']

0    34
1    45
2    27
Name: Age, dtype: int64

In [10]:
df['Age'].mean()

35.333333333333336

In [11]:
df['Age'] > 30

0     True
1     True
2    False
Name: Age, dtype: bool

In [12]:
age_filter = df['Age'] > 30

In [13]:
age_filter

0     True
1     True
2    False
Name: Age, dtype: bool

In [14]:
df[df['Age'] < 30]

     Name  Salary  Age
2  Alyssa   80000   27

In [15]:
df[df['Age'] > 30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

<div class="alert alert-block alert-info">
<div style="direction:rtl;text-align:right;font-family:B Lotus, B Nazanin, Tahoma"> دانشگاه تربیت دبیر شهید رجایی<br>کارگاه پایتون<br>علیرضا اخوان پور<br>96-97<br>
</div>
<a href="https://www.srttu.edu/">SRTTU.edu</a> - <a href="http://pylab.akhavanpour.ir">PyLab.AkhavanPour.ir</a> - <a href="http://AkhavanPour.ir">AkhavanPour.ir</a>
</div>